app/controllers/authors_controller.rb

INSERT INTO `authors` (`name`, `created_at`, `updated_at`) VALUES ('e', '2016-05-30 13:19:14', '2016-05-30 13:19:14')
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE `authors` SET `name` = 'Deitel & Deitel1', `updated_at` = '2016-05-30 13:18:56' WHERE `authors`.`id` = 1
---
  def update
    respond_to do |format|
      if @author.update(author_params)

DELETE FROM `authors` WHERE `authors`.`id` = 4
---
  def destroy
    @author.destroy

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 4 LIMIT 1
---
    def set_author
      @author = Author.find(params[:id])