app/controllers/books_controller.rb

INSERT INTO `books` (`title`, `edition_year`, `author_id`, `created_at`, `updated_at`) VALUES ('teste', 1916, -1, '2016-05-30 12:32:45', '2016-05-30 12:32:45')
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE `books` SET `title` = 'Java How to Program1', `updated_at` = '2016-05-30 13:23:15' WHERE `books`.`id` = 1
---
  def update
    respond_to do |format|
      if @book.update(book_params)