app/controllers/ssc_controller.rb

SELECT `books`.* FROM `books` INNER JOIN `authors` ON `authors`.`id` = `books`.`author_id`  ORDER BY id asc, title desc, edition_year desc
---
    def index
        if !File.exists?("public/orderBooks.txt")
            flash[:error] = "Configuration file not found!"
        else
            arq = File.open("public/orderBooks.txt", "r")
            @fieldOrder = arq.readline.strip
            @modeAscDesc = arq.readline.strip
            arq.close

            if validarOrders(@fieldOrder, @modeAscDesc)
              @books = Book.joins(:author).order(@fieldOrder + ' ' + @modeAscDesc).all